{"keras_version": "1.0.7", "config": [{"config": {"axis": -1, "name": "batchnormalization_1", "input_dtype": "float32", "mode": 0, "trainable": true, "momentum": 0.99, "batch_input_shape": [null, 40, 80, 3], "epsilon": 1e-06}, "class_name": "BatchNormalization"}, {"config": {"activation": "linear", "bias": true, "nb_row": 3, "trainable": true, "activity_regularizer": null, "b_constraint": null, "nb_filter": 32, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_1", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias": true, "nb_row": 3, "trainable": true, "activity_regularizer": null, "b_constraint": null, "nb_filter": 16, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 128, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 64, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 32, "b_regularizer": null, "W_regularizer": null, "name": "dense_3", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "output_dim": 1, "b_regularizer": null, "W_regularizer": null, "name": "dense_4", "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}