{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "BatchNormalization", "config": {"input_dtype": "float32", "epsilon": 1e-06, "trainable": true, "name": "batchnormalization_1", "batch_input_shape": [null, 40, 80, 3], "momentum": 0.99, "mode": 0, "axis": -1}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activation": "linear", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "nb_col": 3, "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_1", "nb_filter": 32, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "output_dim": 128, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "output_dim": 64, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_3", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "output_dim": 32, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_4", "b_regularizer": null, "bias": true, "input_dim": null, "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}}]}