{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "BatchNormalization", "config": {"input_dtype": "float32", "name": "batchnormalization_1", "epsilon": 1e-06, "trainable": true, "momentum": 0.99, "axis": -1, "batch_input_shape": [null, 40, 80, 3], "mode": 0}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_1", "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 32, "activation": "linear", "W_constraint": null, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_2", "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 16, "activation": "linear", "W_constraint": null, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_3", "W_regularizer": null, "trainable": true, "b_regularizer": null, "nb_filter": 8, "activation": "linear", "W_constraint": null, "b_constraint": null, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 128, "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 64, "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 32, "bias": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_4", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 1, "bias": true, "W_regularizer": null}}]}